CSI API ETABS v1
cPointObj.GetTransformationMatrix Method
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
int GetTransformationMatrix(
	string Name,
	ref double[] Value,
	bool IsGlobal = true
)
Function GetTransformationMatrix (
	Name As String,
	ByRef Value As Double(),
	Optional IsGlobal As Boolean = true
) As Integer
Dim instance As cPointObj
Dim Name As String
Dim Value As Double()
Dim IsGlobal As Boolean
Dim returnValue As Integer
returnValue = instance.GetTransformationMatrix(Name,
	Value, IsGlobal)
int GetTransformationMatrix(
	String^ Name,
	array<double>^% Value,
	bool IsGlobal = true
)
abstract GetTransformationMatrix :
        Name : string *
        Value : float[] byref *
        ?IsGlobal : bool
(* Defaults:
        let _IsGlobal = defaultArg IsGlobal true
*)
-> int
Parameters
Name
Type: System.String
Value
Type: System.Double[]
IsGlobal (Optional)
Type: System.Boolean
Return Value
Type: Int32
See Also
Reference
cPointObj Interface
ETABSv1 Namespace